0.1.0/tutorials/incompressible/pimple/elipse_kkl_omega/system/controlDict
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      controlDict;
}

application     mousse-pimple;
startFrom       latestTime;
startTime       0;
stopAt          endTime;
endTime         1;
deltaT          0.001;
writeControl    adjustableRunTime;
writeInterval   0.01;
purgeWrite      0;
writeFormat     binary;
writePrecision  6;
writeCompression uncompressed;
timeFormat      general;
timePrecision   6;
runTimeModifiable true;
adjustTimeStep  yes;
maxCo           0.2;

// vim: set ft=foam et sw=2 ts=2 sts=2:
