0.1.0/tutorials/incompressible/pimple/elipse_kkl_omega/constant/transportProperties
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "constant";
  object      transportProperties;
}

transportModel  Newtonian;
nu              [0 2 -1 0 0 0 0] 1.86e-05;

// vim: set ft=foam et sw=2 ts=2 sts=2:
