0.1.0/tutorials/incompressible/pimple/elipse_kkl_omega/system/topoSetDict
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      topoSetDict;
}

actions
(
  {
    name    f0;
    type    faceSet;
    action  new;
    source  boxToFace;
    sourceInfo
    {
      box (-0.84 -0.31 -0.01)(-0.82 0.31 0.06);
    }
  }
);

// vim: set ft=foam et sw=2 ts=2 sts=2:
